/******************************************************************************

	cps1.c

	CPS1・ィ・゜・螂□`・キ・逾□ウ・「

******************************************************************************/

#include "cps1.h"


/******************************************************************************
	・□`・ォ・□vハ□
******************************************************************************/

/*--------------------------------------------------------
	CPS1・ィ・゜・螂□`・キ・逾□□レサッ
--------------------------------------------------------*/

static int cps1_init(void)
{
	if (!cps1_driver_init())
		return 0;

	return cps1_video_init();
}


/*--------------------------------------------------------
	CPS1・ィ・゜・螂□`・キ・逾□□サ・テ・ネ
--------------------------------------------------------*/

void cps1_reset(void)
{
	Loop = LOOP_EXEC;

	cps1_driver_reset();
	cps1_video_reset();

	timer_reset();
	input_reset();
	sound_reset();

	blit_clear_all_sprite();
}

/*--------------------------------------------------------
	CPS・ィ・゜・螂□`・キ・逾□Kチヒ
--------------------------------------------------------*/

void cps1_exit(void)
{
	cps1_video_exit();
	cps1_driver_exit();
   sound_exit();
   memory_shutdown();

}


int cps1_main(void)
{
   if (memory_init())
   {
      if (sound_init())
      {
         if (input_init())
         {
            if (cps1_init())
            {
               cps1_reset();
               return 1;
            }
            cps1_video_exit();
            cps1_driver_exit();
         }
      }
      sound_exit();
   }
   memory_shutdown();
   return 0;
}
